In [2]:
import sqlite3
import pandas as pd

In [5]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [6]:
data = pd.read_csv('boston.csv')

In [7]:
data.to_sql("boston", con, index=False, if_exists="replace")

In [84]:
pd.read_sql(
    """
    SELECT * FROM boston
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88,11.9

### Все задания нужно выполнить только с помощью sql

1. Выведите количество пустых значений по колонкам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во пустых значений)

In [41]:
pd.read_sql(
    """
    select 'CRIM' as 'Показатель', count(1) as 'Пустых' from boston where CRIM = ""
    union all
    select 'ZN' as 'Показатель', count(1) from boston where ZN = ""
    union all
    select 'INDUS' as 'Показатель', count(1) from boston where INDUS = ""
    union all
    select 'CHAS' as 'Показатель', count(1) from boston where CHAS = ""
    union all
    select 'NOX' as 'Показатель', count(1) from boston where NOX = ""
    """,
    con,
)

  Показатель  Пустых
0       CRIM       0
1         ZN       0
2      INDUS       0
3       CHAS       0
4        NOX       0

In [203]:
pd.read_sql(
    """
    select 'CRIM' as 'Показатель', count(1) as 'Пустых' from boston where CRIM is null
    union all
    select 'ZN' as 'Показатель', count(1) from boston where ZN is null
    union all
    select 'INDUS' as 'Показатель', count(1) from boston where INDUS is null
    union all
    select 'CHAS' as 'Показатель', count(1) from boston where CHAS is null
    union all
    select 'NOX' as 'Показатель', count(1) from boston where NOX is null
    """,
    con,
)

  Показатель  Пустых
0       CRIM       0
1         ZN       0
2      INDUS       0
3       CHAS       0
4        NOX       0

2. Выведите количество уникальных значений по колонокам CRIM, ZN, INDUS, CHAS, NOX (название колонки, кол-во уникальных значений)

In [30]:
pd.read_sql(
    """
    select 'CRIM' as 'Колонка', count(1) as 'Уникальных' from (select distinct CRIM from boston)
    union all
    select 'ZN' as 'Колонка', count(1) from (select distinct ZN from boston)
    union all
    select 'INDUS' as 'Колонка', count(1) from (select distinct INDUS from boston)
    union all
    select 'CHAS' as 'Колонка', count(1) from (select distinct CHAS from boston)
    union all
    select 'NOX' as 'Колонка', count(1) from (select distinct NOX from boston)
    """,
    con,
)

  Колонка  Уникальных
0    CRIM         504
1      ZN          26
2   INDUS          76
3    CHAS           2
4     NOX          81

In [39]:
pd.read_sql(
    """
    select 'CRIM' as 'Колонка', count(distinct CRIM)  as 'Уникальных' from boston
    union all
    select 'ZN' as 'Колонка', count(distinct ZN)  from boston
    union all
    select 'INDUS' as 'Колонка', count(distinct INDUS)  from boston
    union all
    select 'CHAS' as 'Колонка', count(distinct CHAS)  from boston
    union all
    select 'NOX' as 'Колонка', count(distinct NOX)  from boston

    """,
    con,
)

  Колонка  Уникальных
0    CRIM         504
1      ZN          26
2   INDUS          76
3    CHAS           2
4     NOX          81

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX.
Напишите какой вывод можно сделать по данным в этих колонках

In [98]:
pd.read_sql(
    """
    SELECT CRIM, row_number() OVER (ORDER BY CRIM) as 'row', MIN(CRIM) OVER () as 'Min' FROM boston
    """,
    con,
)

         CRIM  row      Min
0     0.00632    1  0.00632
1     0.00906    2  0.00632
2     0.01096    3  0.00632
3     0.01301    4  0.00632
4     0.01311    5  0.00632
..        ...  ...      ...
501  45.74610  502  0.00632
502  51.13580  503  0.00632
503  67.92080  504  0.00632
504  73.53410  505  0.00632
505  88.97620  506  0.00632

[506 rows x 3 columns]

In [113]:
pd.read_sql(
    """
    WITH
    --Т.к. кол-во строк четное медиана = ср арифметическому двух центральных значений
    --Найдем номера этих значений N1, N2 = N1 + 1
    N AS (
        SELECT COUNT(1) / 2 AS 'N1' FROM boston
    ),
    --Зная номера строк найдем медиану. Также сразу посчитаем минимальное значение
    CRIM AS (
        SELECT AVG(CRIM) AS 'MED', MIN FROM (
            SELECT CRIM, row_number() OVER (ORDER BY CRIM) as 'row', MIN(CRIM) OVER () as 'MIN' FROM boston
        ), N
        WHERE row = N.N1 OR row = (N.N1 + 1)
    ),
    ZN AS (
        SELECT AVG(ZN) AS 'MED', MIN FROM (
            SELECT ZN, row_number() OVER (ORDER BY ZN) as 'row', MIN(ZN) OVER () as 'MIN' FROM boston
        ), N
        WHERE row = N.N1 OR row = (N.N1 + 1)
    ),
    INDUS AS (
        SELECT AVG(INDUS) AS 'MED', MIN FROM (
            SELECT INDUS, row_number() OVER (ORDER BY INDUS) as 'row', MIN(INDUS) OVER () as 'MIN' FROM boston
        ), N
        WHERE row = N.N1 OR row = (N.N1 + 1)
    ),
    CHAS AS (
        SELECT AVG(CHAS) AS 'MED', MIN FROM (
            SELECT CHAS, row_number() OVER (ORDER BY CHAS) as 'row', MIN(CHAS) OVER () as 'MIN' FROM boston
        ), N
        WHERE row = N.N1 OR row = (N.N1 + 1)
    ),
    NOX AS (
        SELECT AVG(NOX) AS 'MED', MIN FROM (
            SELECT NOX, row_number() OVER (ORDER BY NOX) as 'row', MIN(NOX) OVER () as 'MIN' FROM boston
        ), N
        WHERE row = N.N1 OR row = (N.N1 + 1)
    )
    SELECT 'CRIM' AS 'Колонка', CRIM.MED AS 'Медиана', CRIM.MIN AS 'Минимальное' FROM CRIM
    UNION ALL
    SELECT 'ZN', ZN.MED, ZN.MIN FROM ZN
    UNION ALL
    SELECT 'INDUS', INDUS.MED, INDUS.MIN FROM INDUS
    UNION ALL
    SELECT 'CHAS', CHAS.MED, CHAS.MIN FROM CHAS
    UNION ALL
    SELECT 'NOX', NOX.MED, NOX.MIN FROM NOX


    """,
    con,
)

  Колонка  Медиана  Минимальное
0    CRIM  0.25651      0.00632
1      ZN  0.00000      0.00000
2   INDUS  9.69000      0.46000
3    CHAS  0.00000      0.00000
4     NOX  0.53800      0.38500

Вывод: в колонках ZN и CHAS больше половины значений нулевые.
Для ZN это означает, что большая часть жилой земли не зонирована на участки площадью более 25 000 кв. футов.
Для CHAS 0 означает, что большинство жилья не граничит с реками

4. Выведите разницу между среднем количеством комнат(RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами. 
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [143]:
pd.read_sql(
    """
    WITH
    CHEAP_25 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV limit 25)
    ),
    EXPENSIVE_25 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV DESC limit 25)
    ),
    CHEAP_50 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV limit 50)
    ),
    EXPENSIVE_50 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV DESC limit 50)
    ),
    CHEAP_100 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV limit 100)
    ),
    EXPENSIVE_100 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV DESC limit 100)
    ),
    CHEAP_200 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV limit 200)
    ),
    EXPENSIVE_200 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV DESC limit 200)
    ),
    CHEAP_300 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV limit 300)
    ),
    EXPENSIVE_300 AS (
        SELECT AVG(RM) AS 'RM' FROM (SELECT RM FROM boston ORDER BY MEDV DESC limit 300)
    )
    SELECT 25 AS 'кол-во домов', CHEAP_25.RM AS 'кол-во комнат в дешевых', EXPENSIVE_25.RM AS 'кол-во комнат в дорогих', EXPENSIVE_25.RM - CHEAP_25.RM AS 'разница' FROM CHEAP_25, EXPENSIVE_25
    UNION ALL
    SELECT 50 AS 'кол-во домов', CHEAP_50.RM AS 'кол-во комнат в дешевых', EXPENSIVE_50.RM AS 'кол-во комнат в дорогих', EXPENSIVE_50.RM - CHEAP_50.RM AS 'разница' FROM CHEAP_50, EXPENSIVE_50
    UNION ALL
    SELECT 100 AS 'кол-во домов', CHEAP_100.RM AS 'кол-во комнат в дешевых', EXPENSIVE_100.RM AS 'кол-во комнат в дорогих', EXPENSIVE_100.RM - CHEAP_100.RM AS 'разница' FROM CHEAP_100, EXPENSIVE_100
    UNION ALL
    SELECT 200 AS 'кол-во домов', CHEAP_200.RM AS 'кол-во комнат в дешевых', EXPENSIVE_200.RM AS 'кол-во комнат в дорогих', EXPENSIVE_200.RM - CHEAP_200.RM AS 'разница' FROM CHEAP_200, EXPENSIVE_200
    UNION ALL
    SELECT 300 AS 'кол-во домов', CHEAP_300.RM AS 'кол-во комнат в дешевых', EXPENSIVE_300.RM AS 'кол-во комнат в дорогих', EXPENSIVE_300.RM - CHEAP_300.RM AS 'разница' FROM CHEAP_300, EXPENSIVE_300
    """,
    con,
)

   кол-во домов  кол-во комнат в дешевых  кол-во комнат в дорогих   разница
0            25                 5.747840                 7.637320  1.889480
1            50                 5.753240                 7.487060  1.733820
2           100                 5.887120                 7.198760  1.311640
3           200                 5.911705                 6.758680  0.846975
4           300                 5.972227                 6.539007  0.566780

5. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг) среди всех знаечений LSTAT. Напишите какой вывод можно сделать по этим данным.

In [155]:
pd.read_sql(
    """
    SELECT LSTAT, MEDV, rank_by_MEDV FROM (
        SELECT MEDV, LSTAT, rank() OVER (PARTITION BY MEDV ORDER BY LSTAT DESC) rank_by_MEDV, MAX(MEDV) OVER () max_MEDV FROM boston
     )
     WHERE MEDV = max_MEDV
    """,
    con,
)
#Вывод: в самых дорогих домах не более 9,53% населения низкого статуса

    LSTAT  MEDV  rank_by_MEDV
0    9.53  50.0             1
1    8.88  50.0             2
2    7.44  50.0             3
3    5.12  50.0             4
4    4.63  50.0             5
5    4.45  50.0             6
6    3.73  50.0             7
7    3.70  50.0             8
8    3.32  50.0             9
9    3.26  50.0            10
10   3.16  50.0            11
11   2.97  50.0            12
12   2.96  50.0            13
13   2.88  50.0            14
14   1.92  50.0            15
15   1.73  50.0            16

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [161]:
pd.read_sql(
    """
    SELECT DISTINCT IIF(CHAS = 1.0, 'граничит', 'не граничит') AS 'С рекой', AVG(MEDV) OVER(PARTITION BY CHAS) AS 'Ср стоимость' FROM boston
    """,
    con,
)

       С рекой  Ср стоимость
0  не граничит     22.093843
1     граничит     28.440000

7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки) выбирая из CRIM, ZN, INDUS, CHAS, NOX. Напишите какой вывод можно сделать по этим данным.

In [174]:
pd.read_sql(
    """
    SELECT Колонка FROM (
        WITH
        CHAS1 AS (
            SELECT DISTINCT CHAS,
                AVG(CRIM) OVER (PARTITION BY CHAS) AS AVG_CRIM,
                AVG(ZN) OVER (PARTITION BY CHAS) AS AVG_ZN,
                AVG(INDUS) OVER (PARTITION BY CHAS) AS AVG_INDUS,
                AVG(NOX) OVER (PARTITION BY CHAS) AS AVG_NOX
            FROM boston
            WHERE CHAS = 1
        ),
        CHAS0 AS (
            SELECT DISTINCT CHAS,
                AVG(CRIM) OVER (PARTITION BY CHAS) AS AVG_CRIM,
                AVG(ZN) OVER (PARTITION BY CHAS) AS AVG_ZN,
                AVG(INDUS) OVER (PARTITION BY CHAS) AS AVG_INDUS,
                AVG(NOX) OVER (PARTITION BY CHAS) AS AVG_NOX
            FROM boston
            WHERE CHAS = 0
        )
        SELECT 'CRIM' AS 'Колонка', CHAS1.AVG_CRIM - CHAS0.AVG_CRIM AS 'Разница' FROM CHAS0, CHAS1
        UNION ALL
        SELECT 'ZN', CHAS1.AVG_ZN - CHAS0.AVG_ZN FROM CHAS0, CHAS1
        UNION ALL
        SELECT 'INDUS', CHAS1.AVG_INDUS - CHAS0.AVG_INDUS FROM CHAS0, CHAS1
        UNION ALL
        SELECT 'NOX', CHAS1.AVG_NOX - CHAS0.AVG_NOX FROM CHAS0, CHAS1
    )
    WHERE Разница > 0
    """,
    con,
)

#Вывод: В среднем у реки больше находится индустриальных объектов и соответственно воздух более загрязнен оксидом азота

  Колонка
0   INDUS
1     NOX

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [199]:
pd.read_sql(
    """
    SELECT a.proc, indus, nox
    FROM
        (SELECT distinct proc , MAX(INDUS) over (partition by proc) indus FROM (
            SELECT NTILE(100) over (ORDER BY INDUS) proc, INDUS FROM boston
        )
        WHERE proc IN (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)) a
        JOIN
        (SELECT distinct proc , MAX(NOX) over (partition by proc) nox FROM (
            SELECT NTILE(100) over (ORDER BY NOX) proc, NOX FROM boston
        )
        WHERE proc IN (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)) b
    WHERE a.proc = b.proc



    """,
    con,
)

#Вывод: между indus и nox прямая взаимосвязь

   proc  indus     nox
0    10   2.97  0.4280
1    20   4.49  0.4429
2    30   6.06  0.4840
3    40   7.38  0.5070
4    50   9.69  0.5380
5    60  13.89  0.5800
6    70  18.10  0.6090
7    80  18.10  0.6710
8    90  19.58  0.7130
9   100  27.74  0.8710

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.